In [1]:
%load_ext sql

In [5]:
%sql mysql+mysqlconnector://root:root@localhost/mydb

In [6]:
%%sql
CREATE TABLE employees (
    employee_id INT PRIMARY KEY,
    first_name VARCHAR(50) NOT NULL,
    last_name VARCHAR(50) NOT NULL,
    hire_date DATE    NOT NULL,
    salary DECIMAL(10,2)
);

   mysql+mysqlconnector://root:***@localhost
 * mysql+mysqlconnector://root:***@localhost/mydb
0 rows affected.

[]

In [8]:
%%sql
select * from employees

   mysql+mysqlconnector://root:***@localhost
 * mysql+mysqlconnector://root:***@localhost/mydb
0 rows affected.

[]

In [9]:
%%sql
CREATE TABLE high_paid_employees AS
SELECT
employee_id,
first_name,
last_name,
salary
FROM employees
WHERE salary > 60000;

   mysql+mysqlconnector://root:***@localhost
 * mysql+mysqlconnector://root:***@localhost/mydb
0 rows affected.

[]

In [12]:
%%sql
CREATE TEMPORARY TABLE temp_high_paid_employees (
    employee_id INT,
    salary DECIMAL(10,2)
);

   mysql+mysqlconnector://root:***@localhost
 * mysql+mysqlconnector://root:***@localhost/mydb
0 rows affected.

[]

In [13]:
%%sql
desc employees

   mysql+mysqlconnector://root:***@localhost
 * mysql+mysqlconnector://root:***@localhost/mydb
5 rows affected.

[('employee_id', 'int', 'NO', 'PRI', None, ''),
 ('first_name', 'varchar(50)', 'NO', '', None, ''),
 ('last_name', 'varchar(50)', 'NO', '', None, ''),
 ('hire_date', 'date', 'NO', '', None, ''),
 ('salary', 'decimal(10,2)', 'YES', '', None, '')]

In [14]:
%%sql
ALTER TABLE employees
add email varchar(100);

   mysql+mysqlconnector://root:***@localhost
 * mysql+mysqlconnector://root:***@localhost/mydb
0 rows affected.

[]

In [15]:
%%sql
desc employees

   mysql+mysqlconnector://root:***@localhost
 * mysql+mysqlconnector://root:***@localhost/mydb
6 rows affected.

[('employee_id', 'int', 'NO', 'PRI', None, ''),
 ('first_name', 'varchar(50)', 'NO', '', None, ''),
 ('last_name', 'varchar(50)', 'NO', '', None, ''),
 ('hire_date', 'date', 'NO', '', None, ''),
 ('salary', 'decimal(10,2)', 'YES', '', None, ''),
 ('email', 'varchar(100)', 'YES', '', None, '')]

In [16]:
%%sql 
alter table employees drop column last_name

   mysql+mysqlconnector://root:***@localhost
 * mysql+mysqlconnector://root:***@localhost/mydb
0 rows affected.

[]

In [17]:
%%sql
desc employees

   mysql+mysqlconnector://root:***@localhost
 * mysql+mysqlconnector://root:***@localhost/mydb
5 rows affected.

[('employee_id', 'int', 'NO', 'PRI', None, ''),
 ('first_name', 'varchar(50)', 'NO', '', None, ''),
 ('hire_date', 'date', 'NO', '', None, ''),
 ('salary', 'decimal(10,2)', 'YES', '', None, ''),
 ('email', 'varchar(100)', 'YES', '', None, '')]

In [21]:
%%sql
alter table employees rename to emp_tables

   mysql+mysqlconnector://root:***@localhost
 * mysql+mysqlconnector://root:***@localhost/mydb
0 rows affected.

[]

In [22]:
%%sql
desc emp_tables

   mysql+mysqlconnector://root:***@localhost
 * mysql+mysqlconnector://root:***@localhost/mydb
5 rows affected.

[('employee_id', 'int', 'NO', 'PRI', None, ''),
 ('first_name', 'varchar(50)', 'NO', '', None, ''),
 ('hire_date', 'date', 'NO', '', None, ''),
 ('salary', 'decimal(10,2)', 'YES', '', None, ''),
 ('email', 'varchar(100)', 'YES', '', None, '')]